package com.example.goem.realtimesubway;

/**
 * Created by GoEM on 2017-10-19.
 */

public class Data {
    public static String[][] lines = {
            {"1001", "소요산", "동두천", "보산", "동두천중앙", "지행", "덕정", "덕계",
            "양주", "녹양", "가능", "의정부", "화룡", "망월사", "도봉산",
            "도봉", "방학", "창동", "녹천", "월계", "광운대", "석계", "신이문",
            "외대앞", "회기", "청량리", "제기동", "신설동", "동묘앞", "동대문",
            "종로5가", "종로3가", "종각", "시청", "서울역", "남영", "용산",
            "노량진", "대방", "신길", "영등포", "신도림", "구로", "구일",
            "개봉", "오류동", "온수", "역곡", "소사", "부천", "중동", "송내",
            "부개", "부평", "백운", "동암", "간석", "주안", "도화", "제물포",
            "도원", "동인천", "인천", "가산디지털단지", "독산", "금천구청",
            "석수", "관악", "안양", "명학", "금정", "군포", "당정", "의왕",
            "성균관대", "화서", "수원", "세류", "병점", "세마", "오산대",
            "오산", "진위", "송탄", "서정리", "지제", "평택", "성환", "직산",
            "두정", "천안", "봉명", "쌍용(나사렛대)", "아산", "배방", "온양온천",
            "신창", "광명", "서동탄"},
            {"1002", "성수", "건대입구", "구의", "강변", "잠실나루", "잠실", "잠실시내",
            "종합운동장", "삼성", "선릉", "역삼", "강남", "교대", "서초", "방배",
            "사당", "낙성대", "서울대입구", "봉천", "신림", "신대방", "구로디지털단지",
            "대림", "신도림", "문래", "영등포구청", "당산", "합정", "홍대입구", "산촌",
            "이대", "아현", "충정로", "시청", "을지로입구", "을지로3가", "을지로4가",
            "동대문역사문화공원", "신당", "상왕십리", "왕십리", "한양대", "뚝섬",
            "도림천", "양천구청", "신정네거리", "까치산", "신설동", "용두", "신답", "용답"},
            {"1003", "대화", "주엽", "정발산", "마두", "백석", "대곡", "화정", "원당", "원흥",
            "삼송", "지축", "구파발", "연신내", "불광", "녹번", "홍제", "무악재",
            "독립문", "경복궁", "안국", "종로3가", "을지로3가", "충무로", "동대입구",
            "약수", "금호", "옥수", "압구정", "신사", "잠원", "고속터미널", "교대",
            "남부터미널", "양재", "매봉", "도곡", "대치", "학여울", "대청", "일원",
                    "수서", "가락시장", "경찰병원", "오금"},
            {"1004", "당고개", "상계", "노원", "창동", "쌍문", "수유", "미아", "미아사거리",
            "길음", "성신여대입구", "한성대입구", "혜화", "동대문", "동대문역사문화공원",
            "충무로", "명동", "회현", "서울역", "숙대입구", "삼각지", "신용산", "이촌",
            "동작", "총신대입구", "사당", "남태령", "선바위", "경마공원", "대공원",
            "과천", "정부과천청사", "인덕원", "평촌", "범계", "금정", "산본", "수리산",
            "대야미", "반월", "상록수", "한대앞", "중앙", "고잔", "안산", "신길온천", "정왕", "오이도"},
            {"1005", "방화", "개화산", "김포공항"},
            {"1006", "봉화산", "화랑대", "태릉입구"},
            {"1007", "장암", "도봉산", "수락산"},
            {"1008", "암사", "천호", "강동구청", "몽촌토성", "잠실", "석촌", "송파", "가락시장", "문정", "장지",
            "복정", "산성", "남한산성입구", "단대오거리", "신흥", "수진", "모란"}
    };
}
